# <center>Pandas Assignment</center>

Import pandas and numpy with their aliases

In [3]:

import numpy as np
import pandas as pd

Create a variable a = pd.Series([ 100, 200, 300, 400])

In [4]:
# a = 
a = pd.Series([ 100, 200, 300, 400])

Print a, and data type

In [5]:
print(a)
print(type(a))

0    100
1    200
2    300
3    400
dtype: int64
<class 'pandas.core.series.Series'>

Using indexing access the element 300 from the series a.

In [6]:
a[2]

300

What are the values of index for series a?

In [7]:
a.index

RangeIndex(start=0, stop=4, step=1)

Change the index to  ['c', 'a', 'b', 'd']

In [8]:
a.index = ["c","a","b","d"]
a

c    100
a    200
b    300
d    400
dtype: int64

Access the value in the series with index 'd'

In [9]:
a["d"]

400

Sort the values wrt to the index and print it

In [10]:
a.sort_index()

a    200
b    300
c    100
d    400
dtype: int64

Create a new Pandas Series b having index as 'e', 'f', and 'g' and value 800,450,100 and print it

In [11]:
b = pd.Series(data = [800,450,100], index = ["e","f","g"])
b

e    800
f    450
g    100
dtype: int64

Append b series at the end of a series

In [12]:
data  = [a,b]
a = pd.concat(data)
a

c    100
a    200
b    300
d    400
e    800
f    450
g    100
dtype: int64

In [13]:
#print a again after appending b into it
a

c    100
a    200
b    300
d    400
e    800
f    450
g    100
dtype: int64

Sort the values in descending order of a and print the index of the sorted series

In [14]:
# a = 
a = a.sort_values()
a.index

Index(['c', 'g', 'a', 'b', 'd', 'f', 'e'], dtype='object')

In [15]:
a

c    100
g    100
a    200
b    300
d    400
f    450
e    800
dtype: int64

## Pandas DataFrame

### Part 1

Create a pandas dataframe df from the series 'a' that we used in the last section, print the dataframe

In [16]:
# df = 
df = pd.DataFrame(data = a)
df

     0
c  100
g  100
a  200
b  300
d  400
f  450
e  800

What is the shape of the datafarme <br>
(also, what does it imply?)

In [17]:
df.shape

(7, 1)

Hey! remember shape (7,1) implies dataframe has 7 rows and 1 column.

What is the index of the dataframe, is it same as the series 'a'

In [18]:
# yep its same as the series.
df.index

Index(['c', 'g', 'a', 'b', 'd', 'f', 'e'], dtype='object')

print the head and tail of the dataframe. <br>
Additional - (what does head and tali represent?)

In [19]:
df.head(5)

     0
c  100
g  100
a  200
b  300
d  400

In [20]:
df.tail(2)

     0
f  450
e  800

Rename the column of the dataframe as 'points'

In [21]:
df.columns

RangeIndex(start=0, stop=1, step=1)

In [22]:
df.columns = ["points"]

In [23]:
df

   points
c     100
g     100
a     200
b     300
d     400
f     450
e     800

In [24]:
type(df)

pandas.core.frame.DataFrame

In [25]:
#Create fruits array

fruits = np.array(["apple","orange","mango"])

In [26]:
#Create series fruits out of fruits array

fruits = pd.Series(fruits)
fruits

0     apple
1    orange
2     mango
dtype: object

Change the index of fruits to the index of dataframe df

In [27]:
fruits.index = df.index[:3]

Add this fruits series as a new column to the dataframe df with its column name as 'fruits'
<br>print the head of the dataframe to verify

In [28]:


df["fruits"] = fruits
df

   points  fruits
c     100   apple
g     100  orange
a     200   mango
b     300     NaN
d     400     NaN
f     450     NaN
e     800     NaN

## Pandas Concatenation

Create a dataframe  d1 where the cols are  ‘city’ : [‘Chandigarh’, ‘Delhi’, ‘Kanpur’, ‘Chennai’, ‘Manali’ ] and ‘Temperature’ : [15, 22, 20, 26,-2]

In [29]:
# d1 = 
data = ({
        "City":["Chandigarh","Delhi","Kanpur","Chennai","Manali"],
        "Temperature":[15, 22, 20, 26,-2]
})
d1 = pd.DataFrame(data)
d1

         City  Temperature
0  Chandigarh           15
1       Delhi           22
2      Kanpur           20
3     Chennai           26
4      Manali           -2

Print(d1)

In [30]:

d1

         City  Temperature
0  Chandigarh           15
1       Delhi           22
2      Kanpur           20
3     Chennai           26
4      Manali           -2

What is the shape of d1.

In [31]:


d1.shape

(5, 2)

Set city = d1['city']

In [32]:

city = d1["City"]

print city <br>
What is the type of city.

In [33]:
print(city)
print(type(city))

0    Chandigarh
1         Delhi
2        Kanpur
3       Chennai
4        Manali
Name: City, dtype: object
<class 'pandas.core.series.Series'>

Create another datafeame 'd2' where the columns are <br>
'city' - ['Bengalaru','Coimbatore','Srirangam','Pondicherry'] <br>
'Temperature' - [24,35,36,39]

In [34]:
# d2 = 
data = ({
        "City":["Bengaluru","Coimbatore","Srirangam","Pondicherry"],
        "Temperature":[24,35,36,39]
})
d2 = pd.DataFrame(data)
d2

          City  Temperature
0    Bengaluru           24
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

print the shape of this dataframe

In [35]:
d2.shape

(4, 2)

merge the two dataframes together, save it in a new dataframe named 'd3'

In [36]:
# d3 = 
data = [d1,d2]
d3 = pd.concat(data)
d3

          City  Temperature
0   Chandigarh           15
1        Delhi           22
2       Kanpur           20
3      Chennai           26
4       Manali           -2
0    Bengaluru           24
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

Select the part of the dataframe such that it contains cities wherer temp is less then or equal to 20 <br>
How many cities are there?

In [37]:
d3[d3["Temperature"] <= 20]

         City  Temperature
0  Chandigarh           15
2      Kanpur           20
4      Manali           -2

Select the part of the dataframe such that it contains the cities where tempearature greater than or equal to 35

In [38]:
d3[d3["Temperature"] >= 35]

          City  Temperature
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

## Applying functions to columns and creating new columns

We need to create another column in d3, which contains  a boolean value for each city to indicate whether it's a union territory or not. 
- HINT: Chandigarh, Pondicherry and Delhi are only 3 union territories here.

In [39]:
d3

          City  Temperature
0   Chandigarh           15
1        Delhi           22
2       Kanpur           20
3      Chennai           26
4       Manali           -2
0    Bengaluru           24
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

In [43]:
# write function here

def func(city):
    if city in ["Chandigarh", "Pondicherry", "Delhi"]:
        return True
    else:
        False

d3["Union Territory"] = d3["City"].apply(func)
d3

          City  Temperature Union Territory
0   Chandigarh           15            True
1        Delhi           22            True
2       Kanpur           20            None
3      Chennai           26            None
4       Manali           -2            None
0    Bengaluru           24            None
1   Coimbatore           35            None
2    Srirangam           36            None
3  Pondicherry           39            True

The temperatures mentioned in ‘Temperature’ column are mentioned in Celsius, we need another column which contains the same in Fahrenheit.

HINT - 
- Define a function c_to_f which takes input temp in celsius and returns a value with temperature in Fahrenheit.
- To check: c_to_f(10) should return 50.

In [45]:
# write function here
def func(celsius):
    F = celsius*(9/5)+32
    return F

d3["Temperature (Fahrenheit)"] = d3["Temperature"].apply(func)
d3

          City  Temperature Union Territory  Temperature (Fahrenheit)
0   Chandigarh           15            True                      59.0
1        Delhi           22            True                      71.6
2       Kanpur           20            None                      68.0
3      Chennai           26            None                      78.8
4       Manali           -2            None                      28.4
0    Bengaluru           24            None                      75.2
1   Coimbatore           35            None                      95.0
2    Srirangam           36            None                      96.8
3  Pondicherry           39            True                     102.2

## Indexing and selecting rows in DataFrame

Select subset of the dataframe d1 such that it contains the cities which are union territories.

In [48]:
d1 = d3
d1[d1["Union Territory"] ==  True]

          City  Temperature Union Territory  Temperature (Fahrenheit)
0   Chandigarh           15            True                      59.0
1        Delhi           22            True                      71.6
3  Pondicherry           39            True                     102.2

Select a subset of the dataframe d1 such that it contains the cities which only have temperature above 90 Farenhiet.

In [49]:
d1[d1["Temperature (Fahrenheit)"] > 90]["City"]

1     Coimbatore
2      Srirangam
3    Pondicherry
Name: City, dtype: object

Select only the first three rows of the dataframe d1.

In [50]:
d1.head(3)

         City  Temperature Union Territory  Temperature (Fahrenheit)
0  Chandigarh           15            True                      59.0
1       Delhi           22            True                      71.6
2      Kanpur           20            None                      68.0

Select all the rows and last two columns in the dataframe.

In [53]:
d1.iloc[:,2:]

  Union Territory  Temperature (Fahrenheit)
0            True                      59.0
1            True                      71.6
2            None                      68.0
3            None                      78.8
4            None                      28.4
0            None                      75.2
1            None                      95.0
2            None                      96.8
3            True                     102.2

## Groupby

In [54]:
# Create a dataframe using dictionary of your choice

df = pd.DataFrame({'Animal': ['Falcon', 'Falcon',
                              'Parrot', 'Parrot'],
                   'Max Speed': [380., 370., 24., 26.]})

df

   Animal  Max Speed
0  Falcon      380.0
1  Falcon      370.0
2  Parrot       24.0
3  Parrot       26.0

In [57]:
# Use Groupby of single column with aggregate sum()
df.groupby(['Animal']).mean()

        Max Speed
Animal
Falcon      375.0
Parrot       25.0

In [22]:
# Use Groupby of single column with aggregate count()
df.groupby(['Animal']).count()

In [59]:
# Use Groupby of single column with aggregate min() and max()
df.groupby(['Animal']).min()

        Max Speed
Animal
Falcon      370.0
Parrot       24.0

In [60]:
df.groupby(['Animal']).max()

        Max Speed
Animal
Falcon      380.0
Parrot       26.0

In [63]:
# Use Groupby of any 2 columns with aggregate mean()
df = pd.DataFrame({"Animal": ['Falcon', 'Falcon', 'Parrot', 'Parrot'],
                    "Type":['Captive', 'Wild', 'Captive', 'Wild'],
                    'Max Speed': [390., 350., 30., 20.]})
df

   Animal     Type  Max Speed
0  Falcon  Captive      390.0
1  Falcon     Wild      350.0
2  Parrot  Captive       30.0
3  Parrot     Wild       20.0

In [66]:
df.groupby(['Animal',"Type"]).mean()

                Max Speed
Animal Type
Falcon Captive      390.0
       Wild         350.0
Parrot Captive       30.0
       Wild          20.0

In [67]:
# Use Groupby of any 2 columns with aggregate min() and max()
df.groupby(['Animal',"Type"]).min()

                Max Speed
Animal Type
Falcon Captive      390.0
       Wild         350.0
Parrot Captive       30.0
       Wild          20.0

In [68]:
df.groupby(['Animal',"Type"]).max()

                Max Speed
Animal Type
Falcon Captive      390.0
       Wild         350.0
Parrot Captive       30.0
       Wild          20.0

## Data Range

Create a pandas daterange where starting date is 1st of January,2020 and end date is 1st of April 2021, store it in a new variable named 'a'

In [69]:
# a = 
start_date = '2020-01-01'
end_date = '2021-04-01'

a = pd.date_range(start=start_date, end=end_date, freq='D')

print a

In [70]:

a

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10',
               ...
               '2021-03-23', '2021-03-24', '2021-03-25', '2021-03-26',
               '2021-03-27', '2021-03-28', '2021-03-29', '2021-03-30',
               '2021-03-31', '2021-04-01'],
              dtype='datetime64[ns]', length=457, freq='D')

What is the len of a?

In [71]:

len(a)

457

What is the type of a?

In [72]:

type(a)

pandas.core.indexes.datetimes.DatetimeIndex